#language: ru

@tree
@Закупки

Функционал: Проверка документа Расход товара

Как Тестировщик я хочу
проверить работу документа Расход товара 
чтобы продажа товара осуществлялась корректно   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Проверка документа Расход товара
	* Подготовка
		И Создание объектов для документа ПриходТовара
	* Заполнение шапки
		И В командном интерфейсе я выбираю "Продажи" "Продажа"
		Тогда открылось окно "Продажа товара (создание)"
		И из выпадающего списка с именем 'Организация' я выбираю точное значение 'ООО "Все для дома"'
		И я нажимаю кнопку выбора у поля с именем 'Покупатель'
		Тогда открылось окно "Контрагенты"
		И в таблице 'Список' я перехожу на один уровень вниз
		И в таблице 'Список' я перехожу к строке:
			| "Код"       | "Наименование"       |
			| "000000013" | 'Магазин "Продукты"' |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Продажа товара (создание) *"
		И из выпадающего списка с именем 'Склад' я выбираю точное значение "Малый"
		И из выпадающего списка с именем 'Валюта' я выбираю точное значение "Рубли"
		И элемент формы 'Вид цен' стал равен 'Оптовая'
	* Заполнение табличной части Товары
		Когда открылось окно "Продажа товара (создание) *"
		И в таблице 'Товары' я нажимаю на кнопку с именем 'КомандаПодбор'
		Тогда открылось окно "Подбор товара"
		И в таблице 'СписокТоваров' я перехожу к строке:
			| "Код"       | "Наименование" |
			| "000000011" | "Продукты"     |
		И в таблице 'СписокТоваров' я перехожу на один уровень вниз
		И в таблице 'СписокТоваров' я перехожу к строке:
			| "Код"       | "Наименование" |
			| "000000030" | "Колбаса"      |
		И в таблице 'СписокТоваров' я перехожу к строке:
			| "Код"       | "Наименование" |
			| "000000099" | "Молочные"     |
		И в таблице 'СписокТоваров' я перехожу на один уровень вниз
		И в таблице 'СписокТоваров' я перехожу к строке:
			| "Код"       | "Наименование" |
			| "000000027" |"Ряженка"       |
		И в таблице 'СписокТоваров' я выбираю текущую строку
		И в таблице 'Товары' я активизирую поле с именем 'ТоварыКоличество'
		И в таблице 'Товары' я выбираю текущую строку
		И в таблице 'Товары' в поле с именем 'ТоварыКоличество' я ввожу текст "5,00"
		И в таблице 'Товары' я завершаю редактирование строки
		И я нажимаю на кнопку с именем 'ОК'
				
		Тогда таблица "Товары" стала равной:
		| 'N' | 'Товар'   | 'Цена'   | 'Количество' | 'Сумма'  |
		| '1' | 'Ряженка' | '55,00'  | '5,00'       | '275,00' |
		И из выпадающего списка с именем 'ВидЦен' я выбираю точное значение "Мелкооптовая"
		Тогда таблица "Товары" стала равной:
		| 'N' | 'Товар'   | 'Цена'   | 'Количество' | 'Сумма'  |
		| '1' | 'Ряженка' | '60,00'  | '5,00'       | '300,00' |
	*Копирование строки
		И в таблице 'Товары' я активизирую поле с именем 'ТоварыТовар'
		И я выбираю пункт контекстного меню с именем 'ТоварыКонтекстноеМенюСкопировать' на элементе формы с именем 'Товары'
		И в таблице 'Товары' я активизирую поле с именем 'ТоварыКоличество'
		И в таблице 'Товары' в поле с именем 'ТоварыКоличество' я ввожу текст "3,00"
		И в таблице 'Товары' я завершаю редактирование строки
		Тогда таблица "Товары" стала равной:
		| 'N' | 'Товар'   | 'Цена'   | 'Количество' | 'Сумма'  |
		| '1' | 'Ряженка' | '60,00'  | '5,00'       | '300,00' |
		| '2' | 'Ряженка' | '60,00'  | '3,00'       | '180,00' |
	*Изменение цены
		И в таблице 'Товары' я перехожу к строке:
			| "N" | "Количество" | "Сумма"  | "Товар"   | "Цена"  |
			| "2" | "3,00"       | "180,00" | "Ряженка" | "60,00" |
		И в таблице 'Товары' я выбираю текущую строку
		И в таблице 'Товары' в поле с именем 'ТоварыЦена' я ввожу текст "20,00"
		И в таблице 'Товары' я завершаю редактирование строки			
		Тогда таблица "Товары" стала равной:
		| 'N' | 'Товар'   | 'Цена'   | 'Количество' | 'Сумма'  |
		| '1' | 'Ряженка' | '60,00'  | '5,00'       | '300,00' |
		| '2' | 'Ряженка' | '20,00'  | '3,00'       | '60,00'  |
	*Изменение суммы
		И в таблице 'Товары' я перехожу к строке:
			| "N" | "Количество" | "Сумма"  | "Товар"   | "Цена"  |
			| "2" | "3,00"       | "60,00" 	| "Ряженка" | "20,00" |
		И в таблице 'Товары' в поле с именем 'ТоварыСумма' я ввожу текст "180,00"
		И в таблице 'Товары' я завершаю редактирование строки
		Тогда таблица "Товары" стала равной:
		| 'N' | 'Товар'   | 'Цена'   | 'Количество' | 'Сумма'  |
		| '1' | 'Ряженка' | '60,00'  | '5,00'       | '300,00' |
		| '2' | 'Ряженка' | '20,00'  | '3,00'       | '180,00' |
	* Удаление строки
		И в таблице 'Товары' я перехожу к строке:
			| "N" | "Количество" | "Сумма"  | "Товар"   | "Цена"  |
			| "2" | "3,00"       | "180,00"	| "Ряженка" | "20,00" |
		И я выбираю пункт контекстного меню с именем 'ТоварыКонтекстноеМенюУдалить' на элементе формы с именем 'Товары'
		Тогда таблица "Товары" стала равной:
		| 'N' | 'Товар'   | 'Цена'   | 'Количество' | 'Сумма'  |
		| '1' | 'Ряженка' | '60,00'  | '5,00'       | '300,00' |
	* Добавление строки
		И в таблице 'Товары' я нажимаю на кнопку с именем 'ТоварыДобавить'
		И в таблице 'Товары' из выпадающего списка с именем 'ТоварыТовар' я выбираю по строке "Ря"
		И я перехожу к следующему реквизиту
		И в таблице 'Товары' я завершаю редактирование строки
		Тогда таблица "Товары" стала равной:
		| 'N' | 'Товар'   | 'Цена'   | 'Количество' | 'Сумма'  |
		| '1' | 'Ряженка' | '60,00'  | '5,00'       | '300,00' |
		| '2' | 'Ряженка' | '60,00'  | '1,00'       | '60,00'  |
	* Проведение
		Когда открылось окно "Продажа товара (создание) *"
		И я нажимаю на кнопку с именем 'ФормаПровести'
		Тогда открылось окно "Продажа * от *"
		И В текущем окне я нажимаю кнопку командного интерфейса "Регистр взаиморасчетов с контрагентами"
		Тогда таблица 'Список' стала равной:
			| "Период"              | "Регистратор"                              | "Номер строки" | "Контрагент"         | "Сумма"  | "Валюта" |
			| "*" 					| "*" 										 | "1"            | 'Магазин "Продукты"' | "360,00" | "Рубли"  |				
		И В текущем окне я нажимаю кнопку командного интерфейса "Регистр продаж"
		Тогда таблица 'Список' стала равной:
			| "Период"              | "Регистратор"                              | "Номер строки" | "Покупатель"         | "Товар"   | "Количество" | "Сумма"  |
			| "*" 					| "*" 										 | "1"            | 'Магазин "Продукты"' | "Ряженка" | "5,00"       | "300,00" |
			| "*" 					| "*" 										 | "2"            | 'Магазин "Продукты"' | "Ряженка" | "1,00"       | "60,00"  |		
		И В текущем окне я нажимаю кнопку командного интерфейса "Регистр товарных запасов"
		Тогда таблица 'Список' стала равной:
			| "Период"              | "Регистратор"                              | "Номер строки" | "Товар"   | "Склад" | "Количество" |
			| "*" 					| "*" 										 | "1"            | "Ряженка" | "Малый" | "5,00"       |
			| "*" 					| "*" 										 | "2"            | "Ряженка" | "Малый" | "1,00"       |
	* Тест печатных форм
		Когда открылось окно "Продажа * от *"
		И В текущем окне я нажимаю кнопку командного интерфейса "Основное"
		И я нажимаю на кнопку с именем 'ФормаДокументРасходТовараПечатьРасходнойНакладной'
		И Пауза 5
		И табличный документ "SpreadsheetDocument" содержит строки из макета "МакетПФРасходнаяНакладная" по шаблону
						
	* Ошибка проведения
		И я закрываю текущее окно
		Когда открылось окно "Продажа * от *"
		И В текущем окне я нажимаю кнопку командного интерфейса "Основное"
		И в таблице 'Товары' я перехожу к строке:
			| "N" | "Количество" | "Сумма"  | "Товар"   | "Цена"  |
			| "1" | "5,00"       | "300,00" | "Ряженка" | "60,00" |
		И в таблице 'Товары' я активизирую поле с именем 'ТоварыКоличество'
		И в таблице 'Товары' я выбираю текущую строку
		И в таблице 'Товары' в поле с именем 'ТоварыКоличество' я ввожу текст "9 999,00"
		И в таблице 'Товары' я завершаю редактирование строки
		И я нажимаю на кнопку с именем 'ФормаПровести'
		Тогда открылось окно "1С:Предприятие"
		И я нажимаю на кнопку с именем 'OK'
		Тогда в логе сообщений TestClient есть строки:
			|"Не хватает 1 единиц товара\"Ряженка\" на складе\"Малый\".Максимальное количество: 0."|